---
kind: method
id: M:Autodesk.Revit.DB.Form.MoveProfile(System.Int32,Autodesk.Revit.DB.XYZ)
zh: 对话框、窗口、窗体
source: html/5276bf3d-d91c-62ea-5004-5e565c2b0ece.htm
---
# Autodesk.Revit.DB.Form.MoveProfile Method

**中文**: 对话框、窗口、窗体

Move a profile of the form, specified by a reference, and an offset vector.

## Syntax (C#)
```csharp
public void MoveProfile(
	int profileIndex,
	XYZ offset
)
```

## Parameters
- **profileIndex** (`System.Int32`) - Index to specify the profile.
- **offset** (`Autodesk.Revit.DB.XYZ`) - The vector by which the element is to be moved.